~/test-1-Alpha1831$ gcc -g p7original.c
~/test-1-Alpha1831$ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) beak main
Undefined command: "beak".  Try "help".
(gdb) break main
Breakpoint 1 at 0x72b: file p7original.c, line 7.
(gdb) r
Starting program: /home/runner/test-1-Alpha1831/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7original.c:7
7   {
(gdb) n
9     x=input_array_size();
(gdb) s
input_array_size () at p7original.c:17
17  {
(gdb) n
19    printf("Enter the number elements:");
(gdb) s
__printf (format=0x561e2f800a14 "Enter the number elements:")
    at printf.c:28
28  printf.c: No such file or directory.
(gdb) c
Continuing.
Enter the number elements:3
1
7
11
1+7+11 is 19[Inferior 1 (process 32) exited normally]
(gdb) 